import java.util.HashMap;
import java.util.Scanner;

public class Main {
    static HashMap<Integer, String> Trains = new HashMap<>();
    static HashMap<Integer, String> Buses = new HashMap<>();
    static int time = 0;

    public static void fillTrainsScheldude(){
        Trains.put(101, "Коваль-Чернівці. Прибуття: 00:32. Відправлення: 01:01. Прибуття в Іван-Франківськ: 04:08");
        Trains.put(311, "Чернігів-Івано-Франківськ. Прибуття: 02:46. Відправлення: 03:11. Прибуття в Іван-Франківськ: 05:43");
        Trains.put(312, "Київ(Пасажирський)-Івано-Франківськ. Прибуття: 02:49. Відправлення: 03:12. Прибуття в Іван-Франківськ: 05:43");
        Trains.put(523, "Київ(Пасажирський)-Івано-Франківськ. Прибуття: 05:03. Відправлення: 05:23. Прибуття в Іван-Франківськ: 07:35");
        Trains.put(708, "Одесса-Главная-Рахів. Прибуття: 06:35. Відправлення: 07:08. Прибуття в Іван-Франківськ: 09:40");
        Trains.put(1041, "Константинівка-Івано-Франківськ. Прибуття: 10:21. Відправлення: 10:41. Прибуття в Іван-Франківськ: 13:08");
        Trains.put(1110, "Миколаїв(Пасажирський)-Івано-Франківськ. Прибуття: 10:49. Відправлення: 11:10. Прибуття в Іван-Франківськ: 13:35");
        Trains.put(1546, "Львів-Рахів. Прибуття: -. Відправлення: 15:46. Прибуття в Іван-Франківськ: 18:47");
        Trains.put(1720, "Москва-Чернівці. Прибуття: 14:25. Відправлення: 17:20. Прибуття в Іван-Франківськ: 20:08");
        Trains.put(1957, "Київ(Пасажирський)-Івано-Франківськ. Прибуття: 19:57. Відправлення: 20:17. Прибуття в Іван-Франківськ: 22:16");
    }
    public static void fillBusesScheldude(){
        Buses.put(635, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 06:35. Прибуття: 10:20 Вартість: 116,49 грн.");
        Buses.put(700, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 07:00. Прибуття: 10:55 Вартість: 131,10 грн.");
        Buses.put(705, "АС: вул.Стрийська, 109. Відправлення: 07:05. Прибуття: 10:20 Вартість: 125,08 грн.");
        Buses.put(730, "АС: вул.Стрийська, 109. Відправлення: 07:30. Прибуття: 10:50 Вартість: 125,08 грн.");
        Buses.put(735, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 07:35. Прибуття: 11:05 Вартість: 121,90 грн.");
        Buses.put(800, "АС: вул.Стрийська, 109. Відправлення: 08:00. Прибуття: 11:05 Вартість: 125,09 грн.");
        Buses.put(830, "АС: вул.Стрийська, 109. Відправлення: 08:30. Прибуття: 12:10 Вартість: 135,48 грн.");
        Buses.put(910, "АС: вул.Стрийська, 109. Відправлення: 09:10. Прибуття: 12:45 Вартість: 118,07 грн.");
        Buses.put(1010, "АС: вул.Стрийська, 109. Відправлення: 10:10. Прибуття: 13:45 Вартість: 135,48 грн.");
        Buses.put(1035, "АС: вул.Стрийська, 109. Відправлення: 10:35. Прибуття: 14:05 Вартість: 126,78 грн.");
        Buses.put(1045, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 10:45. Прибуття: 13:55 Вартість: 131,10 грн.");
        Buses.put(1110, "АС: вул.Стрийська, 109. Відправлення: 11:10. Прибуття: 13:55 Вартість: 125,08 грн.");
        Buses.put(1210, "АС: вул.Стрийська, 109. Відправлення: 12:10. Прибуття: 15:50 Вартість: 138,34 грн.");
        Buses.put(1211, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 12:10. Прибуття: 17:50 Вартість: 158,70 грн.");
        Buses.put(1230, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 12:30. Прибуття: 16:40 Вартість: 150,65 грн.");
        Buses.put(1240, "АС: вул.Стрийська, 109. Відправлення: 12:40. Прибуття: 16:20 Вартість: 135,48 грн.");
        Buses.put(1245, "АС: вул.Стрийська, 109. Відправлення: 12:45. Прибуття: 17:00 Вартість: 153,40 грн.");
        Buses.put(1315, "АС: вул.Стрийська, 109. Відправлення: 13:15. Прибуття: 16:40 Вартість: 132,17 грн.");
        Buses.put(1330, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 13:30. Прибуття: 17:30 Вартість: 131,10 грн.");
        Buses.put(1335, "АС: вул.Стрийська, 109. Відправлення: 13:35. Прибуття: 17:05 Вартість: 125,76 грн.");
        Buses.put(1400, "АС: вул.Стрийська, 109. Відправлення: 14:00. Прибуття: 17:20 Вартість: 125,08 грн.");
        Buses.put(1425, "АС: вул.Стрийська, 109. Відправлення: 14:25. Прибуття: 17:55 Вартість: 118,07 грн.");
        Buses.put(1515, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 15:15. Прибуття: 19:00 Вартість: 131,10 грн.");
        Buses.put(1545, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 15:45. Прибуття: 20:00 Вартість: 158,70 грн.");
        Buses.put(1605, "АС: вул.Стрийська, 109. Відправлення: 16:05. Прибуття: 19:30 Вартість: 125,08 грн.");
        Buses.put(1620, "АС: вул.Стрийська, 109. Відправлення: 16:20. Прибуття: 19:20 Вартість: 153,40 грн.");
        Buses.put(1635, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 16:35. Прибуття: 21:00 Вартість: 158,70 грн.");
        Buses.put(1710, "АС: вул.Стрийська, 109. Відправлення: 17:10. Прибуття: 20:00 Вартість: 116,49 грн.");
        Buses.put(1715, "АС: вул.Стрийська, 109. Відправлення: 17:15. Прибуття: 21:00 Вартість: 153,38 грн.");
        Buses.put(1740, "АС: пл.Двірцева, 1 (Зал. вокзал). Відправлення: 17:40. Прибуття: 21:10 Вартість: 123,59 грн.");
        Buses.put(1810, "АС: вул.Стрийська, 109. Відправлення: 18:10. Прибуття: 21:45 Вартість: 118,07 грн.");
        Buses.put(1925, "АС: вул.Стрийська, 109. Відправлення: 19:25. Прибуття: 22:10 Вартість: 135,46 грн.");
    }
    public static void getTime() {
        Scanner input = new Scanner(System.in);
        System.out.println("Введіть годину в форматі (0-23): ");
        time = input.nextInt();
        if (time > 23) {
            System.out.println("Невірний формат часу. Перезапустіть програму.");
            System.exit(1);
        } else if (time < 0) {
            System.out.println("Невірний формат часу. Перезапустіть програму.");
            System.exit(1);
        }
    }
    public static void showScheldude() {
        int trainsOptions = 0;
        int busesOptions = 0;
        System.out.println(" ");
        System.out.println("Поїзди:");
        for (int i = (time * 100); i <= 2359; i++) {
            if (Trains.containsKey(i)) {
                trainsOptions++;
                System.out.println(Trains.get(i));
            }
        }
        if (trainsOptions == 0) {
            System.out.println("Нажаль зараз немає можливості відправитися поїздом.");
        }
        System.out.println(" ");
        System.out.println("Автобуси:");
        for (int i = (time * 100); i <= 2359; i++) {
            if (Buses.containsKey(i)) {
                busesOptions++;
                System.out.println(Buses.get(i));
            }
        }
        if (busesOptions == 0) {
            System.out.println("Нажаль зараз немає можливості відправитися автобусом.");
        }
    }
    public static void showInfo(){
        System.out.println("================================================================================================\n" +
                "|| Курсова робота з дисципліни Алгоритмізація та програмування                                ||\n" +
                "|| Розробив: ст.гр. ІТ-21 Оліференко Євгеній                                                  ||\n" +
                "|| Керівник курсової роботи: доц. каф. ІСТ Луб П.М.                                           ||\n" +
                "|| Тема: система підтримки прийняття рішень при плануванні маршруту зі Львова в Ів.Франківськ ||\n" +
                "================================================================================================");
    }

    public static void main (String[] args){
        Main.showInfo();
        Main.fillTrainsScheldude();
        Main.fillBusesScheldude();
        Main.getTime();
        Main.showScheldude();
        }
    }
